example_repeatMesh/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             steadyState;
}

gradSchemes
{
    default             Gauss linear;
    limited         cellLimited Gauss linear 1;

    grad(k)         $limited;
    //grad(epsilon)   $limited;
    grad(omega)     $limited;
}

divSchemes
{
    default             none;

    div(phi,U)          bounded Gauss linearUpwind limited;
    turbulence		bounded Gauss limitedLinear 1;
    div(phi,k)          $turbulence;
    div(phi,epsilon)    $turbulence;
    div(phi,omega)	$turbulence;

    div((nuEff*dev2(T(grad(U)))))    Gauss linear;
}

laplacianSchemes
{
    default             Gauss linear limited corrected 0.33;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default             limited corrected 0.33;
}


// ************************************************************************* //
